[{"id":2,"title":"End the Private School Giveaway","author":"BC Humanist Association","date":"","content":""},{"id":4,"title":"Thank your MP for backing the Refugee Medevac Bill","author":"Universal Children's Day","date":"November 20, 2018","content":"Thank you for your addressing the MEDICAL CRISIS facing people in Australia's offshore detention! Sick and injured people under our care, will now be able to receive necessary treatment. \n\nI wanted to say how much I appreciate the democracy in action I've witnessed over the last month with the negotiations and decisions on the refugee medical evacuation bill. \n\nI wrote to you recently to ask you to back the bill on my behalf, and I am so happy with the result. I know it has not been easy to maintain a true path in the face of the Government's border security rhetoric. The transparent, enforceable and timely process detailed in Bill provides a medical solution to a medical problem but also upholds our border protection.\n\nI'll be very proud to support you again in the future, so long as a commitment to Australia's humanitarian and human rights record remains among your priorities. "},{"id":1,"title":"#NOMoreFEAR for Australians with Type 1 Diabetes - Lifesaving Technology NOW","author":"Stephanie Young and Tegan Sporer","date":"","content":"Every Australian with T1D deserves Lifesaving Continuous Glucose Monitoring"},{"id":6,"title":"Stop industrialisation of Exmouth Gulf","author":"Protect Ningaloo","date":"","content":"As you know, the Environmental Protection Authority (EPA) has just released a major report that warns of the increasing pressure on Exmouth Gulf’s environment and calls for the protection of its unique and globally significant values.\n\nDespite the Gulf’s fragility and global importance, one major industrial development after another has been proposed for the area, from oil and gas pipeline fabrication, to a large-scale salt production proposal (K+S Salt).\n\nThe latest is the Gascoyne Gateway industrial port proposed to be built adjacent to Qualing Pool, a beautiful, tranquil and rare freshwater oasis, and one of the sensitive areas the EPA has specifically recommended for a high level of protection. \n\nJust offshore from Qualing Pool is one of the world’s most important humpback whale resting and nursery areas. Humpback whale mothers and calves need to rest undisturbed to build up their reserves before the arduous migration to Antarctica. Yet, incredibly, this is where the industrial port and shipping channel would be built. Dredgers would remove more than one million cubic metres of seafloor to enable massive ships to reach the port in an area also known for its dugongs, dolphins, sponges, corals and diverse fish species.\n  \nMinister, you will understand why I and many thousands of others find proposals like this to be unacceptable and why we want you to end the cycle of industrial threats to the Gulf. I urge you to protect Exmouth Gulf, Ningaloo, and secure its world-class tourism economy and the growing marine research, cultural tourism and education opportunities that complement the area’s natural and cultural assets.\n\nI call on you to make clear as a matter of urgency that your Government will protect Exmouth Gulf and remove the threat of industrial development like the Gascoyne Gateway industrial port.\n\nNow is the moment to demonstrate your leadership and seize the opportunity to leave a positive and sustainable legacy for Exmouth Gulf, Ningaloo.\n"},{"id":5,"title":"Protect Dingoes","author":"Dingo Protection","date":"","content":"Federal, state and territory governments are failing to protect dingoes.  \n\nAt present the fate of dingoes is decided by sheep and cattle producers, industry representative bodies, pesticide companies and other industry interests. They do not represent my interests.  \n\nI respectfully call on you to:\n\n1.     Use the taxon Canis dingo and term dingo, not ‘wild dog’, when communicating with stakeholders, so that it is clear what animal is being targeted / killed. \n\n2.     Lobby the Minister for the Environment to approve nomination for dingo loss as a key threatening process under the EPBC Act. \n\n3.     Abandon the current National Wild Dog Action Plan and produce a new framework that prioritises the perspectives of Aboriginal people, independent ecologists and the general public.\n\n4.     Take responsibility for decisions about dingoes’ future away from industry organisations with a vested interest in current management techniques and profits over public interests\n\n5.     Ban cruel and indiscriminate use of 1080 and strychnine poison in Australia. \n\n6.     Invest in research and pilot programs for non-lethal livestock protection methods with a view to developing long term, sustainable strategies for dingoes and livestock to safely co-exist within the Australian landscape.\n\n\nREASONS FOR MY REQUEST\n\nDingoes are a majestic, keystone native Australian species.\n\nThe dingo is recognised as a native Australian species under the Environment Protection and Biodiversity Conservation Act 1999 section 528 which defines a native species as one that was present in Australia before the year 1400 (2).\n\nDingoes have many physical and behavioural features that distinguish them from other canids. These features allow them to survive in challenging Australian environments (3).\n\nDingoes have been incorporated into Aboriginal society.  They are widely recognised as part of creation, “dreaming” knowledge and law (4, 5).\n\nDingoes are valued globally as an iconic Australian species.\n\nAs a native apex predator dingoes play a critical role in ecosystem resilience and stability (6-10).  Their role includes:\n- Picking off old, sick and genetically weak individuals, slowing the spread of disease and ensuring healthy populations of their prey species.\n- Preying on both introduced and native herbivores, regulating the number of kangaroos, rabbits, feral pigs etc resulting in improved vegetation cover.\n- Keeping foxes and feral cats in check, which in turn gives life to many small-medium mammals, marsupials, native birds and other species.\n\nThe taxonomic status of dingoes is political and contentious. Science is proving that dingoes are a distinct species (Canis dingo) – genetically, behaviourally, morphologically (10) - and yet vested interests promote them as ‘wild dogs’, ‘pests’ or ‘feral’ domestic dogs (Canis familiaris) to justify lethal control (11, 12).  A major recent study of public understandings found that most people (over 80%) were not aware that the targets of “wild dog” management included dingoes.  Most respondents considered dingoes native to Australia (over 80%) and there was low level of approval of lethal control of dingoes (13).\n\nFailure to recognise dingoes as a separate species, misinformation that they are an ‘introduced’ species and / or exaggerated claims of hybridisation with domestic dogs diminishes their critical role as Australia’s native apex land predators\n\nThis mess of terminology is misleading and confusing.  Language and classifications used by government should be supported by independent scientists, not dictated by industry / industry affiliated ‘experts’.\n\nDingoes may prey upon sheep and, sometimes, cattle especially if the stock are weak or there is a lack of other prey (increased stock predation has been associated with poor husbandry practices and biodiversity destruction) (14).\n\nIn response to perceived risks to stock, dingoes are being killed on an industrial scale across Australia through widespread ‘lethal control’ under the National Wild Dog Action Plan (15).  Methods include trapping, shooting and, most commonly poisoning, including aerial dropping of 1080.  The RSPCA does not regard 1080 or traps as humane.  Traps incorporating strychnine laced clothes are considered to be especially cruel (16, 17).\n\nHowever, the real scale of threat posed by dingoes to the wool and meat livestock industries is small.  For example, in New South Wales and Victoria annual sheep losses are reported as less than 0.01% of the total flock. ‘Wild dog’ predation accounts for only a fraction of this (18). Research conducted in central and Northern Australia has shown lethal control of dingoes does not reduce cattle production impacts (19, 20). A growing number of producers are reporting that dingoes can be valuable partners in agriculture (21).\n\nThe Environment Protection and Biodiversity Conservation Act 1999 (EPBC Act) is the Australian Government's principal piece of environment legislation (2). \n\nThe EPBC Act aims to protect Australia's native species and ecological communities by providing for:\n\n- Identification and listing of species as threatened\n- Recognition of key threatening processes \n- The dingo has been frequently nominated for protection under the EPBC Act as a threatened species and dingo loss as a key threatening process, due to the cascading effects of the loss or removal of dingoes from Australian landscapes (22, 23)\n\nIn 2017 the Threatened Species Scientific Committee recommended that dingo loss be included in the proposed priority assessment list for key threatening processes.  This decision was rejected by the then Environment Minister and was consequently excluded from consideration thereafter (23). \n\nAustralia’s Framework for dingo management is the ‘National Wild Dog Action Plan’ (The Plan). This Plan is extremely dangerous for dingoes’ survival as a species.   \n\nThe Plan is a \"livestock industry-driven initiative\". The copyright for the Plan is held by © 2020 Australian Wool Innovation Ltd.   It unabashedly represents the interests of meat livestock, wool and pesticide industry operators over the interests of the environment, culture and dingoes (15). \n\nREFERENCES\n\n1.     Philip, J. (2017).  The Cultural History of the Dingo https://www.australiangeographic.com.au/topics/wildlife/2017/08/cultural-history-of-the-dingo/\n\n2.     Australian Government Environment Protection and Biodiversity Conservation Act 1999  https://www.legislation.gov.au/Details/C2016C00777\n\n3.     Browning, M., Watson, L., Cairns, K. (2021) Dingoes: Champions of Biodiversity, Australian Deer, Volume 46, Number 4 (2021)\n\n4.     Philip, Justine. (2020). The Waterfinders. A Cultural History Of The Australian Dingo. Australian Zoologist. 10.7882/AZ.2020.034\n\n5.     Phelan, S.(2007) Conducting Dog Health Programs In Indigenous Communities: A Veterinary Guide https://mk0amrricqek1rx8x5cc.kinstacdn.com/wp-content/uploads/2020/01/Conducting_dog_health_programs_june-08.pdf\n\n6.     Schroeder, T., Lewis, M. M, Kilpatrick, A. D., Moseby, K. E. (2015) Dingo Interactions with Mesopredators: Spatiotemporal Dynamics in an Australian Arid-Zone Study, Wildlife Research 42(6), 529-539, (9 November 2015) https://www.publish.csiro.au/wr/WR15104\n\n7.     Newsome, T. Greenville, A. Ćirović, D. et al. (2017) Top Predators Constrain Mesopredator Distributions. Nature Communications 8, 15469. https://doi.org/10.1038/ncomms15469\n\n8.     Fisher, Adrian. Mills, Charlotte. Lyons, Mitchell. Cornwell, William. Letnic, Mike (2021) Remote Sensing Of Trophic Cascades: Multi‐Temporal Landsat Imagery Reveals Vegetation Change Driven By The Removal Of An Apex Predator. Landscape Ecol 36, 1341–1358. https://doi.org/10.1007/s10980-021-01206-w\n\n9.     Wallach, A. (2011) Reviving Ecological Functioning With Dingo Restoration https://www.academia.edu/2069055/Reviving_Ecological_Functioning_with_Dingo_Restoration\n\n10.  Smith B.P., Cairns K.M., Adams J.W., Newsome T.M., Fillios M., Déaux E.C., Parr W.C.H., Letnic M., van Eeden L.M., Appleby R.G., Bradshaw C.J.A., Savolainen P., Ritchie E.G., Nimmo D.G., Archer-Lean C., Greenville A.C., Dickman C.R., Watson L., Moseby K.E., Doherty T.S., Wallach A.D., Morrant D.S., Crowther M.S.. Taxonomic Status Of The Australian Dingo: The Case For Canis Dingo Meyer, 1793. Zootaxa. 2019 Mar 4;4564(1):zootaxa.4564.1.6. https://www.mapress.com/zt/article/view/zootaxa.4564.1.6\n\n11.  Kreplins T. L., Gaynor A., Kennedy M. S., Baudains C. M., Adams P., Bateman P. W., Fleming P. A. (2018) What To Call A Dog? A Review Of The Common Names For Australian Free-Ranging Dogs. Pacific Conservation Biology 25, 124-134. https://doi.org/10.1071/PC18018\n\n12.  Farm Online 98 9ce4  https://www.farmonline.com.au/story/7193342/debate-over-dingo-versus-wild-dog-does-the-name-matter/\n\n13.  van Eeden, L. M., Crowther M. S., Dickman C. R., Newsome T.M. Wicked “wild dogs”: Australian public awareness of and attitudes towards dingoes and dingo management  Australian Zoologist (2021) 41 (3): 467–479.\n\n14.  Arian D. Wallach, Daniel Ramp, Adam J. O’Neill, Cattle Mortality On A Predator-Friendly Station In Central Australia, Journal of Mammalogy, Volume 98, Issue 1, 8 February 2017, Pages 45–52, https://doi.org/10.1093/jmammal/gyw156\n\n15.  Australian Wool Innovation Ltd (2020) National Wild Dog Action Plan 2020 - 2030: Promoting and supporting community-driven action for landscape-scale wild dog management © 2020 Australian Wool Innovation Ltd, all rights reserved.\n\n16.  RSPCA What is the RSPCA’s view on using 1080 for pest animal control? https://kb.rspca.org.au/knowledge-base/what-is-the-rspcas-view-on-using-1080-for-pest-animal-control/\n\n17.  RSPCA View on the trapping of wild dogs https://kb.rspca.org.au/knowledge-base/what-is-the-rspcas-view-on-the-trapping-of-wild-dogs/\n\n18.  https://modernfarmer.com/2013/12/dingos-devouring-australias-sheep-industry/#:~:text=According%20to%20Lyn%20Watson%2C%20the,sheep%20producing%20states%20near%20Queensland\n\n19.  Johnson, Chris & Wallach, Arian. (2016). The Virtuous Circle: Predator-Friendly Farming And Ecological Restoration In Australia. Restoration Ecology. 24. 10.1111/rec.12396.\n\n20.  Edwards G. P., Eldridge S. R., Shakeshaft B. J., Nano T. (2021) Lethal Control Reduces the Relative Abundance of Dingoes but Not Cattle Production Impacts. Wildlife Research https://doi.org/10.1071/WR20076\n\n21.  Landholders for Dingoes https://landholdersfordingoes.org/\n\n22.  Australian Government Key threatening process nominations not prioritised for assessment https://www.awe.gov.au/environment/biodiversity/threatened/nominations/ktp-not-prioritised-assessment\n\n23.  Australian Government Species nominations not prioritised for assessment https://www.awe.gov.au/environment/biodiversity/threatened/nominations/species-not-prioritised-assessment\n\n\n\n"},{"id":8,"title":"Save Afghanistan Now","author":"Action for Afghanistan","date":"December 11, 2019","content":"I am writing to you as your constituent to express my grave concerns over the rapidly deteriorating humanitarian crisis in Afghanistan and the need for urgent action. \n\nOver a year after the fall of Kabul, and after almost two decades of intervention the Australian government has a moral obligation to take immediate action in response to the humanitarian crisis in Afghanistan.\n\nThe former Morrison government only committed to providing 16,500 additional humanitarian visas, spaced over 4 years. More than 211,100 people from Afghanistan have applied for humanitarian protection so far. Australia has a moral obligation to provide at least 20,000 emergency humanitarian visa places immediately. \n\nToday, more than 71,500 people from Afghanistan call Australia home and contribute to Australia’s prosperity in our schools, hospitals, construction sites, in academia and more. \n\nIn light of this history and engagement between our two nations, I urge you to join the growing number of public voices and take proactive measures to secure: \n\n- At least 20,000 emergency additional humanitarian visas for people escaping danger in Afghanistan. \n\n- Granting of permanent protection to refugees from Afghanistan already in Australia on temporary visas. These people now face a heightened state of insecurity and cannot continue to live in limbo. \n\n- Prioritising partner and family reunification visas of people from Afghanistan who are currently awaiting to be reunited with their family members in safety in Australia. \n\n- Expediting the resettlement of translators, guides, Afghan National Defense and Security Forces and other personnel who assisted Australian and allied forces in the preceding 20 year military engagement.\n\n- Lifting the ban on resettlement of refugees to Australia through the United Nations High Commissioner for Refugees in Indonesia.\n\n- The provision of urgent humanitarian aid for the millions of people including children in Afghanistan facing starvation.  \n\nI urge you and your fellow MPs to please consider the action points and voice your strong support for continuing Australia’s long relationship with the people of Afghanistan. \n\nI look forward to your response."},{"id":7,"title":"Rare Disease Day 2022 Building Illumination","author":"Rare Disease UK","date":"","content":"I would like to politely request the illumination of your building on 28 February 2022 for Rare Disease Day to recognise the challenges faced by people with a rare condition and stand in solidarity. Please can this email be passed on to the relevant team?\n \nHere is some more information about the day for your consideration. \n \nDespite having different conditions people with rare conditions face common challenges. Three quarters of all rare diseases affect children, and we estimate that rare diseases are responsible for about a third of infant mortality in the UK. On average it takes four years for someone with a rare condition to receive an accurate diagnosis. Additionally, there are licensed medicinal products available for only a small minority of rare diseases making it incredibly difficult for patients to access potentially life-changing treatments.\n \nThe 28 February 2022 is Rare Disease Day, a patient-led awareness day to raise awareness for the over 300 million people worldwide living with a rare disease. Rare Disease Day began in 2008 with 18 countries. Today, participation has grown significantly with events in over 100 countries in 2021. In February 2021, over 100 landmarks were illuminated in over 38 countries around the world for Rare Disease Day. This year, homes across the globe will also be illuminated at 7pm on 28 February to participate in awareness-raising and show solidarity.\n \n The Rare Disease Day colours are blue, pink, green and purple. Please find a colour guide here - http://download2.rarediseaseday.org/Colours_to_request.pdf.\n \nThank you for considering our application and I look forward to hearing from you."},{"id":10,"title":"Open Letter opposing Star Casino Redevelopment","author":"Greater Sydney Community","date":"March 2, 2019","content":"I do not support the current proposal and concur with the Open Letter to the Independent Planning Commission, published in the SMH on Monday, 26 August 2019."}]